app/controllers/admin/achievements_controller.rb

SELECT * FROM `achievements` ORDER BY rank
---
  def index
    @achievements = Achievement.find :all, :order => "rank"

SELECT * FROM `achievements` WHERE (`achievements`.`id` = 1)
---
  def edit
    @achievement = Achievement.find(params[:id])

SELECT * FROM `achievements` WHERE (`achievements`.`id` = 1)
UPDATE `achievements` SET `description` = 'I founded <a href=\"http://cockatoosoftware.com.au\">Cockatoo Software</a> in November 2007 in preparation for commencing freelance work in January 2008. So far several clients have kept me busy developing web applications using Ruby on Rails and providing technology advice.', `updated_at` = '2009-04-19 02:06:09' WHERE `id` = 1
---
  def update
    @achievement = Achievement.find(params[:id])
    begin
      @achievement.update_attributes(params[:achievement])