app/controllers/admin/blog_posts_controller.rb

SELECT * FROM `blog_posts` ORDER BY created_at desc
---
  def index
    @blog_posts = BlogPost.find :all, :order => "created_at desc"