app/controllers/admin/services_controller.rb

SELECT * FROM `services` ORDER BY rank
---
  def index
    @services = Service.find :all, :order => "rank"

SELECT * FROM `services` WHERE (`services`.`name` = 'agileweb') LIMIT 1
---
  def edit
    @service = Service.find_by_name(params[:id])

SELECT * FROM `services` WHERE (`services`.`name` = 'agileweb') LIMIT 1
UPDATE `services` SET `description` = 'h2. What do I mean by Technology Mentoring?\r\n\r\nSome people take to using technology like ducks to water. Others break out into a cold sweat. Many are between these extremes when it comes to confidently and effectively using computer technology.\r\n\r\nh2. What do I offer?\r\n\r\nI offer mentoring to people who require assistance with using computer software tools. Whether it is a word processor, a database management system or a programming Interactive Development Environment (IDE), if I have expertise in the tool then I offer mentoring to clients who need to improve their effectiveness quickly.\r\n\r\nh2. My Experience\r\n\r\nSince the early part of my career as a programmer I have acted as a mentor to less experienced team members. As personal computers became more and more accessible I found myself helping family members, friends and acquaintances more and more. Professionally, over the last seven years I have taught many courses during which I have helped software developers learn more effective ways of using programming IDEs.' WHERE `id` = 4
---
  def update
    @service = Service.find_by_name(params[:id])
    begin
      @service.update_attributes!(params[:service])