app/controllers/admin/testimonials_controller.rb

SELECT * FROM `testimonials` ORDER BY rank
---
    def index
      @testimonials = Testimonial.all

SELECT * FROM `testimonials` WHERE (`testimonials`.`id` = 1)
---
    def edit
      @testimonial = Testimonial.find(params[:id])