app/controllers/blog/archives_controller.rb

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`param` = '2008-10-28-osdc-2008-earlybird-registration-closing-this-friday') LIMIT 1
---
  def show
    @blog_post = BlogPost.find_by_param params[:id]