app/controllers/about_controller.rb

SELECT * FROM `testimonials` ORDER BY rank
SELECT * FROM `achievements` ORDER BY rank
---
  def index
    @section = 'about'
    @testimonials = Testimonial.find :all, :order => 'rank'
    @achievements = Achievement.find :all, :order => 'rank'