app/controllers/blog_controller.rb

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`published` = 1) ORDER BY created_at desc LIMIT 5
---
  def index
    @section = 'blog'
    @blog_posts = BlogPost.published.limit(5)