app/controllers/services_controller.rb

  def index
    first_service = Service.find :first, :order => 'rank'
---
SELECT * FROM `services` ORDER BY rank LIMIT 1

  def show
    @section = 'services'
    @current_service = Service.find_by_name(params[:id])
---
SELECT * FROM `services` WHERE (`services`.`name` = 'overview') LIMIT 1